content/posts/call-me-perma.md
+++
title = "Call Me Perma"
author = ["Perma"]
date = 2023-08-09T12:31:00+03:30
tags = ["update", "perma", "names"]
categories = ["long"]
draft = false
+++

I find myself seated in the passenger's seat of my mother's car, as we make our way to an appointment with an educational psychologist. A sense of confusion and concern lingers within me, stemming from my mother's sudden and puzzling reaction to my C-graded report card. The journey passes quietly, and we arrive at the specialist's office without exchanging a word, leaving me still uncertain about the purpose of our visit.

The psychologist initiates our session by administering a series of aptitude and intelligence tests appropriate for my age. Throughout the process, my mother's keen gaze remains fixed on me, intensifying my nerves. Eventually, the psychologist validates my mother's suspicions, revealing that my intellectual capabilities far exceed those of my peers. This revelation prompts my mother to shed light on the purpose of our enigmatic expedition: <q cite="my mother"> You see, you are not stupid, you are actually very smart, you just lack self-esteem!</q> Was that truly the root of the issue? While self-esteem was a factor in my unhappniess, I couldn't help but feel that my lack of effort had deeper origins.

Oh, but this wasn't the first round of this comical saga. You see, on previous occasions, my dear mother would strategically place a glass of water right between us, like a cosmic prop. And what was the grand purpose behind this visual spectacle, you might ask? Well, it was her way of nudging me into a philosophical monologue about that very glass. In simple terms: <q cite="my mother">Hey, kiddo, you've got a shortage of optimism; you're the sort who tends to spot the half-empty glass in life.</q>

And then we have my dear old dad, the master of responsibility training. He had this grand plan to shape my character, using internships as his secret weapon. <q cite="my father">Off you go, my young apprentice!</q> he'd exclaim, nudging me into one vocational adventure after another. His hidden message? <q cite="my father">Kid, I'm passing down the sacred skill of handling responsibilities!</q> Ah, the age-old dance of parental strategy.

And there you have it, my childhood summed up, right from the time those kindergarten teachers began their chorus of complaints about my apparent "refusal" to embrace the songs that my peers had effortlessly committed to memory months before.

As the days went by, I began to adopt a personal mantra: <q cite="me">I'm the poster child for laziness, the embodiment of irresponsibility, with motivation and vision nowhere to be found.</q> Oddly enough, despite knowing full well the significance of education and being genuinely captivated by the realms of science and math, my actions seemed to tell a different story altogether. It's as if I was presenting evidence that contradicted my own beliefs. Perhaps deep down, I questioned my care for my parents, struggled to find motivation, or maybe I secretly aspired to master the art of freeloadery.

The haze of doubt began to lift when I embarked on an <abbr title="Attention-Deficit/Hyperactivity Disorder">ADHD</abbr> medication journey, and lo and behold, I experienced the novel sensation of being able to sit down and read a paragraph without my mind spiraling into chaos. It was like finally playing a video game where you no longer wonder if you're in control of that character's movements or not. My epiphany was quite the reverse: "Oh, wait a minute, I can indeed make decisions and stick with them?"

Let me tell you, this realization was liberating, to put it mildly. Suddenly, I had the capacity to invest time in the very things that had ignited my curiosity.

<abbr title="Attention-Deficit/Hyperactivity Disorder">ADHD</abbr> has had a profound impact on  my life since childhood. One revelation that became clear after seeking medication was the extent to which I had surrendered agency and intentionality.

My existence had been defined by reactivity, with a noticeable absence of honed decision-making skills. I found myself in a state of passivity, or even worse, mere reactivity. Nonetheless, I consistently strived to reclaim it.


## Recent Victories {#recent-victories}

Over the past few years, I've encountered an almost comically disproportionate share of misfortune and have found myself under substantial duress. Yet, I've navigated my way through these challenges.

I won't delve into the specifics of these misfortunes, although those in my social circles can attest to their unusual frequency.

However, I can share that I've achieved several noteworthy milestones during this time span: acquiring programming skills, entering the workforce, entering marriage, and most recently, opting to unofficially change my name.

Formally, I remain <span class="person p-name">Amirhossein</span>, and I'm content should anyone choose to continue addressing me as such-I hold no animosity toward it. Nevertheless, it inadequately captures the depth of my identity.


## <span class="person p-name">Amirhossein</span> and <span class="person p-name">Perma</span> {#bb76b9}

The name Amirhossein is a composite of two Arabic names, Amir and Hossein, both of which carry two meanings. As for the firsts of these meanings, Amir translates to "prince," while Hossein signifies "Good-junior." The amalgamation results in the interpretation of "Junior Good Prince."

However, I find myself at a loss when attempting to establish a personal connection with any aspect of this interpretation of this name. This brings us to its secondary and perhaps more intended connotation.

In Shia Islam, there exists a concept akin to Christianity's sainthood, known as "<dfn>Imam</dfn>". However, these Imams are asserted to be leaders of the Islamic community. The first of these figures holds the title "<span class="person p-name">Amir-al-momenin</span>," or the "prince of the faithful," commonly abbreviated as Amir. The third Imam, the second son of the first, was named <span class="person p-name">Hossein</span>. Both individuals deviate significantly from pacifism.

While these historical and linguistic connections hold merit, I must underscore a significant twist: since the age of 15, I have consciously disavowed Islam and theism in their entirety.

I find "<span class="person p-name">Perma</span>" to be a more fitting option, resonating more harmoniously with my ears. Moreover, it aligns with certain themes and passions that hold significance in my life. It closely aligns with the ethos underpinning this blog. I'm captivated by the philosophy of the _PermaCulture_ and _PermaComputing_ movements-albeit not necessarily their current implementations. My fascination lies in harmonizing with the world rather than coercing it to conform to my presence. Moreover, the notion of leaving a lasting imprint on the world holds a special allure for me. However, this yearning leans more toward the aesthetic realm rather than being rooted in _utilitarian_ aspirations.


## Dear Reader {#dear-reader}

If you've known me previously, you might have observed my recent shifts in usernames, emails, and name. Across the internet, I've opted for `Prma` instead of the more direct `Perma`, as the latter is frequently claimed or could serve other entities more fittingly.

However, this change isn't indicative of a complete unveiling of my authentic self. Thus, referring to me by my previous name isn't as insensitive as the act of deadnaming. Rather, this transition signifies the inception of a renewed chapter, one marked by heightened purpose and intention.

While I do prefer and hope for the usage of "<span class="person p-name">Perma</span>" moving forward, I'm entirely at ease if you choose otherwise. Your decision in this regard is genuinely respected.
